cursos/dio/dio-formacao-ruby/desafio-06/app/controllers/blogs_controller.rb

  def index
    @books = Book.all.limit(10)
---
SELECT "books".* FROM "books" LIMIT 10