cursos/dio/dio-formacao-ruby/desafio-06/app/controllers/books_controller.rb

INSERT INTO "books" ("title", "author", "star", "description", "created_at", "updated_at") VALUES ('Outro livro', 'Mais um', 3, 'Lorem ipsum dolor sit amet consectetur adipisicing elit. Ut autem quidem quo, magni necessitatibus ullam commodi accusantium voluptatum labore maiores totam temporibus explicabo incidunt, illo praesentium iste odit, libero et?', '2026-01-22 20:49:58.410559', '2026-01-22 20:49:58.410559') RETURNING "id"
---
  def create
    @book = Book.new(book_params)

    respond_to do |format|
      if @book.save

UPDATE "books" SET "description" = 'Lorem ipsum dolor sit amet consectetur adipisicing elit. Ut autem quidem quo, magni necessitatibus ullam commodi accusantium voluptatum labore maiores totam temporibus explicabo incidunt, illo praesentium iste odit, libero et?', "updated_at" = '2026-01-22 20:46:50.521893' WHERE "books"."id" = 1
---
  def update
    respond_to do |format|
      if @book.update(book_params)

SELECT "books".* FROM "books" WHERE "books"."id" = 5 LIMIT 1
---
    def set_book
      @book = Book.find(params.expect(:id))